$(function(){

  $('.top-contents').click(function(){
    $('.top-contents h1').text('دا ځکه چې هرڅوک باید مړ شي، ګورولوفوف په ورته غږ وویل چې د پخوا په څیر.دا سوسا ده. په عین حال کې د لیسانس سند هیڅ دلیل نه دی، هغه وویل، او په خیټه کې، کیدای شي دا سړی ریښتینی روسی نه وي، او روسان باید داسې مسخره کیسه وکړي، ما فکر کاوه چې دا شتون نلري.او ناڅاپه د دې نیلي، طنزیه زده کونکي افسر سره مخامخ ناست ناخوښه شو، او ما فکر وکړ چې زه به ودریږم او کور ته لاړ شم.ګورورو بوف وویل چې هغه دلیل چې ما یوازې یادونه وکړه په دې وخت کې زما د فکرونو لپاره کافي و.د اختلاف وړ. سولودونیکوف ملنډې ووهلې او ومنله چې هغه له تاسو سره کومه شخړه نه لري، ویل یې چې دلیل کافي یا ناکافي و. او د ناخوښۍ احساس پیاوړی شو. همدا وجه ده چې دغه استاذ چې فکر یې یو احمق او تنګ نظر شوی و، یوه جدي، بې معنی او وحشتناکه مسئله مطرح کړه چې مرګ څه شی دی. د مقابلې اړتیا نشته. په ورته وخت کې، دا اړینه ده چې چمتو شي، ګورورو بوف وویل.په پای کې، سولودونیکوف دواړه ابرو په تندی کې ځړول او خندل. دا ځکه چې ما فکر کاوه چې د شاګرد افسر وروستی آیت هغه خندونکی آیت و چې ما تمه درلوده.ګورولوف وویل چې هغه د مرګ په اړه فکر کاوه ترڅو مرګ ته چمتو شي.ستومانه. ولې باید په دې اړه فکر وکړو؟ ځکه چې زه هره ورځ خورم، څښم او ویده کیږم، او بیا یوه ورځ بوډا شوم، ژاړم، سر مې راښکته کیږي، نو زه خورم، څښم، ویده کیږم او ویده شم، د لیسانس درجې ته ولاړ، ویې ویل چې باید فکر وکړم. د داسې احمقانه شیانو په اړه یو له بل سره ، او دا چې هغه باید د بل چا سره په سپک ډول چلند وکړ.هو. که نه، نو د ښوونکي افسر غمجن شو او سر یې وخوځاوه. دا سمه نه ده. لکه څنګه چې ښوونکي پخپله وویل، دا ټول مسخره وه. تاسو اړتیا نلرئ د احمقانه شیانو په اړه فکر وکړئ. په عین حال کې، مرګ انه دی');
  });

  var welcome = ['welcome!','ようこそ！','欢迎欢迎！','Тавтай морил!','Bienvenidos!','مرحبا!','Seja bem-vindo!','Ласкаво просимо!','ښه راغلاست!','Willkommen!','សូមស្វាគមន៍!','καλως!','Välkommen!','Nnọọ!','Hoş geldin!','ברוכים הבאים!','어서 오세요！','Tervetuloa!','მოგესალმებით!'];
  n=0;

  setInterval(function(){
    $('.top-contents h1').text(welcome[n]);
    n++;
    if(n==welcome.length){
      n=0;
    }
  },100);

  var color = ['darkorange','orange','crimson','deeppink','magenta','dodgerblue'];
  i=0;

  setInterval(function(){
    $('body').css({'background-color':color[i]});
    i++;
    if(i==color.length){
      i=0;
    }
  },150);

  $('.menu').hover(
    function(){
      $(this).css({'opacity':'1'});
      $(this).css({'font-size':'22px'});
    },
    function(){
      $(this).css({'opacity':'0.8'});
      $(this).css({'font-size':'19px'});
    }
  );

  $('.fab').hover(
    function(){
      $(this).css({'color':'red'});
    },
    function(){
      $(this).css({'color':'white'});
    }
  );
});
